Documents/СборкаЗаказовПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СборкаЗаказовПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НоменклатураГотоваяЕхатьККлиенту</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСборкеНоНеСобранные</xr:Item>
				<xr:Item>AccumulationRegister.СобраноПоЗаказу</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыГотовыеКСборке</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеКодовМаркировкиСУЗ</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСборке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставкиКлиенту</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСобранИУпакован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесУпаковочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьПоРегиструТоварыВСборке</Name>
					<Comment>// временная мера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолностьюОткорректирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспресс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаКомплектации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияКомплектации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковыватьСамовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаксиДоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоставщикаТОХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказано</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подборка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПодборкаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выдано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Собрано</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подборка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПодборкаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыТорговогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыТорговогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихКода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговаяСистема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFIDМеток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПодборкаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПодборкаНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИдетПодборка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТорговогоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СборкаЗаказовПокупателя/Ext/ManagerModule.bsl
Функция ПолучитьИмяПринтераЭтикеток()
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РабочиеМестаОборудование.Значение
	                      |ИЗ
	                      |	Справочник.РабочиеМеста.Оборудование КАК РабочиеМестаОборудование
	                      |ГДЕ
	                      |	РабочиеМестаОборудование.Ссылка.Код = &Идентификатор
	                      |	И РабочиеМестаОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ПринтерЭтикеток)");
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьЗначениеТипаШтрихкодаДляЭУ(ТипКода)

	Перем Значение;
	
	Если ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
		Значение = 0;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
		Значение = 1;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128 Тогда
		Значение = 2;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39 Тогда
		Значение = 3;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128 Тогда
		Значение = 4;
	Иначе
		Значение = -1;
	КонецЕсли;
	
	Возврат Значение;  
	
КонецФункции 

Процедура ПечатьСтекара(Сборка, ГрузовоеМесто, СразуНаПринтер = Истина) Экспорт

	Если НЕ ГрузовоеМесто.Проведен Тогда
		
		Сообщить("Документ грузовое место не проведен !");
		Возврат;  
		
	КонецЕсли;
	
	Принтер = "";
	
	Если СразуНаПринтер Тогда
		
		Принтер = ПолучитьИмяПринтераЭтикеток();
		
		Если Не ЗначениеЗаполнено(Принтер) Тогда
			Сообщить("В базе не настроен принтер этикеток для текущего рабочего места");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Константы.ЭтикеткаГрузоместаРостов.Получить() Тогда
		
		ПечатьСтикераРостов(Принтер,Сборка, ГрузовоеМесто, СразуНаПринтер);
		Возврат; 
		
	КонецЕсли;
	
	ДокументШтрихКода = ГрузовоеМесто;
	
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	Макет               = ПолучитьМакет("ШтрихКодыГУИД");
	ОбластьЭтикетка 	= Макет.ПолучитьОбласть("ЭтикеткаШирина|ЭтикеткаВысота");
	
	Если ЗначениеЗаполнено(Сборка.Назначение) Тогда
		
		ОбластьЭтикетка.Параметры.Контрагент = "ТРАНЗИТ_" + Строка(Сборка.Назначение.Грузополучатель);
		ОбластьЭтикетка.Параметры.Маршрут = СокрЛП(Сборка.Назначение.Маршрут) + " (" + ВРег(Лев(Сборка.Назначение.БазаОтправитель, 3)) + ")";  
		ОбластьЭтикетка.Параметры.КодКлиента = Сборка.Назначение.ГрузополучательКод; 
		ОбластьЭтикетка.Параметры.М = ?(ЗначениеЗаполнено(Сборка.Назначение.ДатаОтгрузкиЗаказа), СокрЛП(Сборка.Назначение.ДатаОтгрузкиЗаказа), СокрЛП(Сборка.ДатаДоставкиКлиенту));

	Иначе
		
		ОбластьЭтикетка.Параметры.Контрагент = Строка(Сборка.Грузополучатель);
		ОбластьЭтикетка.Параметры.Маршрут = ?(Сборка.ТаксиДоставка, "ТАКСИ",СокрЛП(Сборка.Грузополучатель.МаршрутДоставки));
		ОбластьЭтикетка.Параметры.КодКлиента = СокрЛП(Строка(Сборка.Грузополучатель.Код));
		ОбластьЭтикетка.Параметры.М = СокрЛП(Сборка.ДатаДоставкиКлиенту); 
		
	КонецЕсли;     
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент,Макет,ОбластьЭтикетка,ДокументШтрихКода);  	 
	
	ОбластьЭтикетка.Параметры.Сборка = "Сборка №" + Сборка.Номер + " от " + Формат(Сборка.Дата, "ДЛФ=D");
	
	ОбластьЭтикетка.Параметры.Мест = "ГМ" + ОбщегоНазначения.ПолучитьНомерНаПечать(ГрузовоеМесто,,,Истина);
	ОбластьЭтикетка.Параметры.Ответственный = Лев(СокрЛП(Сборка.Комплектовщик.Наименование),25);
	ТабличныйДокумент.Вывести(ОбластьЭтикетка);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 		
	
	ТабличныйДокумент.ПолеСверху = 0.1;
	ТабличныйДокумент.ПолеСлева = 1;
	ТабличныйДокумент.ПолеСнизу = 0.1;
	ТабличныйДокумент.ПолеСправа = 1;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПринтера = Принтер;
	
	Если СразуНаПринтер Тогда
		ТабличныйДокумент.Напечатать(); 
	Иначе
		ТабличныйДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьСтикераРостов(Принтер,Сборка, ГрузовоеМесто, СразуНаПринтер = Истина) ЭКСПОРТ

	ТабличныйДокумент	= Новый ТабличныйДокумент;
	Макет               = ПолучитьМакет("ШтрихКодыРостов");
	ОбластьЭтикетка 	= Макет.ПолучитьОбласть("ЭтикеткаШирина|ЭтикеткаВысота");

	Если ЗначениеЗаполнено(Сборка.Назначение) Тогда

		ПромИмяСклада = ВРег(Лев(Константы.ИмяИБВКластере.Получить(),3));
		ОбластьЭтикетка.Параметры.Контрагент = ПромИмяСклада+"_ТРАНЗИТ_" + Строка(Сборка.Назначение.Грузополучатель);
		ОбластьЭтикетка.Параметры.Маршрут = СокрЛП(Сборка.Назначение.Маршрут) + " (" + ВРег(Лев(Сборка.Назначение.БазаОтправитель, 3)) + ")";  
		
	Иначе
		ОбластьЭтикетка.Параметры.Контрагент = Строка(Сборка.Грузополучатель);
		ОбластьЭтикетка.Параметры.Маршрут = ?(Сборка.ТаксиДоставка, "ТАКСИ",СокрЛП(Сборка.Грузополучатель.МаршрутДоставки));
	КонецЕсли; 

	ОбластьЭтикетка.Параметры.Дата = ТекущаяДата();
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент,Макет,ОбластьЭтикетка,ГрузовоеМесто); 
	
	ОбластьЭтикетка.Параметры.Сборка = ОбщегоНазначения.ПолучитьНомерНаПечать(ГрузовоеМесто,,,Истина);//Строка(Число(Сборка.Номер));// + " от " + Формат(Дата, "ДЛФ=D");
	ОбластьЭтикетка.Параметры.Ответственный = ?(НЕ ЗначениеЗаполнено(Сборка.Комплектовщик), ПараметрыСеанса.ТекущийПользователь.ФизЛицо, Сборка.Ответственный) ;
	
	ТабличныйДокумент.Вывести(ОбластьЭтикетка);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабличныйДокумент.ПолеСверху = 0.1;
	ТабличныйДокумент.ПолеСлева = 1;
	ТабличныйДокумент.ПолеСнизу = 0.1;
	ТабличныйДокумент.ПолеСправа = 1;
	ТабличныйДокумент.ВысотаСтраницы = 58;
	ТабличныйДокумент.ШиринаСтраницы = 28;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПринтера = Принтер;
	
	Если СразуНаПринтер Тогда
		ТабличныйДокумент.Напечатать();
	Иначе
		ТабличныйДокумент.Показать();
	КонецЕсли;

КонецПроцедуры

Функция СоздатьСборкиПоЗаказуПокупателя(ДокЗаказ, ТекстОшибки, Отказ) Экспорт
	
	тзДляСборки = Новый ТаблицаЗначений;
	тзДляСборки.Колонки.Добавить("Отметка");   
	тзДляСборки.Колонки.Добавить("ЗаказНаСборку");
	тзДляСборки.Колонки.Добавить("ДоговорКонтрагента");
	тзДляСборки.Колонки.Добавить("Грузополучатель");
	тзДляСборки.Колонки.Добавить("Контрагент");
	тзДляСборки.Колонки.Добавить("СпособДоставки");
	тзДляСборки.Колонки.Добавить("Принудительно");
	
	ДобСтрока = тзДляСборки.Добавить();
	ДобСтрока.Отметка = Истина;
	ДобСтрока.ЗаказНаСборку = ДокЗаказ.Ссылка;   
	ДобСтрока.Контрагент = ДокЗаказ.Контрагент;
	ДобСтрока.ДоговорКонтрагента = ДокЗаказ.ДоговорКонтрагента;
	ДобСтрока.Грузополучатель = ДокЗаказ.Грузополучатель;  
	ДобСтрока.Принудительно = Ложь;
	ДобСтрока.СпособДоставки = ДокЗаказ.СпособДоставки;  
	
	МассивСборок = Новый Массив;
	
	Попытка
		
		ОбработкаСборки = Обработки.СоздатьДокументыПриказНаСборку.Создать();  
		ОбработкаСборки.СоздатьДокументы(тзДляСборки, Ложь, 0, Ложь, Ложь, МассивСборок);  

	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина;  
		
	КонецПопытки;
	
	Возврат МассивСборок;

КонецФункции

Процедура ЗаполнитьСборкуПоЗаказуПокупателя(ДокЗаказ, ДанныеСборки, ТекстОшибки, Отказ) Экспорт
	
	ДокСборка = Документы.СборкаЗаказовПокупателя.СоздатьДокумент();
	ДокСборка.Дата 				  = ДанныеСборки.Дата;
	ДокСборка.Контрагент 		  = ДокЗаказ.Контрагент;
	ДокСборка.Грузополучатель 	  = ДокЗаказ.Грузополучатель;
	ДокСборка.МаршрутДоставки 	  = ДанныеСборки.МаршрутДоставки;
	ДокСборка.Договор 			  = ДокЗаказ.ДоговорКонтрагента;
	ДокСборка.СпособДоставки 	  = ДокЗаказ.СпособДоставки;
	ДокСборка.ВремяНачалаСборки   = ДанныеСборки.ВремяНачалаСборки;
	ДокСборка.ВремяОкончанияСборки= ДанныеСборки.ВремяОкончанияСборки;
	ДокСборка.ДатаДоставкиКлиенту = ДанныеСборки.ДатаДоставкиКлиенту;
	ДокСборка.Организация 		  = ДокЗаказ.Организация;
	
	Для каждого тзСтрока Из ДанныеСборки.ТоварыЗаказа Цикл
	
		НоваяСтрокаСборки = ДокСборка.Заказано.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСборки, тзСтрока);
		НоваяСтрокаСборки.Подборка = Перечисления.ПодборкаНоменклатуры.Собрано;
		НоваяСтрокаСборки.Заказ = ДокЗаказ;

	КонецЦикла;

	ДокСборка.КоличествоУпаковочныхМест = ДанныеСборки.КоличествоУпаковочныхМест;
	ДокСборка.ДокументСобранИУпакован = ДанныеСборки.ДокументСобранИУпакован;
	
	Попытка
		ДокСборка.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина;  
		Возврат;
		
	КонецПопытки;   
	
	Попытка
		ДокСборка.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина; 
		
	КонецПопытки;   

КонецПроцедуры
